#include <stdio.h>
#include <stdlib.h>
/********************************
题目
求出π的值，根据给出公式π/2=1+1/3+1/3*2/5+1/3*2/5*3/7+...，
从键盘输入要求满足的精度。（即前后两次求得的π相差小于输入精度）
采用float型，输出采用七位有效数字型如3.xxxxxx。
例如输入0.001，输出3.141106.
********************************/
int main()
{
  int i = 1;             //循环变量
  float a,b1;          //a为精度，b1为上一个二分之派
  float b2 = 1.0;    //b2为下一个二分之派
  scanf("%f",&a);
    do
    {
         b1 = b2;
         b2 = b1  +b1* (i /  (2*i+1));
         i++;
     }while(2*b2 - 2*b1 > a);
     printf("%f",2*b2);
}
